# globals.py

# Версія та назва програми

version = "v2.16.5"
name_prog = "SportForAll "
# Поля для заповнення
FIELDS = [
    "товар", "дк", "захід", "дата", "адреса", "пдв", "кількість", "ціна за одиницю",
    "сума", "сума прописом","загальна сума","разом"
]

# Підказки для кожного поля
EXAMPLES = {
    "товар": "наприклад: медалі зі стрічкою",
    "дк": "наприклад: 18512200-3",
    "захід": "наприклад: 4 етапу “Фізкультурно-оздоровчих заходів...",
    "дата": "наприклад: з 06 по 09 травня, з 13 по 16 травня 2025 року",
    "адреса": "наприклад: КП МСК “Дніпро”, вул. Смілянська, 78, м. Черкаси.",
    "сума": "(Автоматично)",
    "сума прописом": "(Автоматично)",
    "пдв": "наприклад: без ПДВ",
    "кількість": "наприклад: 144",
    "ціна за одиницю": "наприклад: 105.00",
    "загальна сума": "(Автоматично)",
    "разом": "(Автоматично)"
}

# Глобальні змінні для GUI
document_blocks = []  # Список блоків договорів
main_app_root = None
scroll_frame_main = None
main_context_menu = None

