# globals.py

# Версія програми
version = "v2.12"

# Поля для заповнення
FIELDS = [
    "товар", "дк", "захід", "дата", "адреса", "сума",
    "сума прописом", "пдв", "кількість", "ціна за одиницю",
    "загальна сума",
    "разом"
]

# Підказки для кожного поля
EXAMPLES = {
    "товар": "наприклад: медалі зі стрічкою",
    "дк": "наприклад: ДК 021:2015: 18512200-3",
    "захід": "наприклад: 4 етапу “Фізкультурно-оздоровчих заходів...",
    "дата": "наприклад: з 06 по 09 травня, з 13 по 16 травня 2025 року",
    "адреса": "наприклад: КП МСК “Дніпро”, вул. Смілянська, 78, м. Черкаси.",
    "сума": "наприклад: 15120.00",
    "сума прописом": "Автоматично (П’ятнадцять тисяч сто двадцять грн 00 коп.)",
    "пдв": "наприклад: без ПДВ",
    "кількість": "наприклад: 144",
    "ціна за одиницю": "наприклад: 105.00",
    "загальна сума": "теж саме, що i поле разом",
    "разом": "Автоматично (15120.00)"
}

# Глобальні змінні для GUI
document_blocks = []  # Список блоків договорів
main_app_root = None
scroll_frame_main = None
main_context_menu = None
